---
kind: type
id: T:Autodesk.Revit.DB.Visual.ConcreteSealantType
source: html/dff62aea-d6b5-4912-e5e9-2f31dc9e7377.htm
---
# Autodesk.Revit.DB.Visual.ConcreteSealantType

The enumerated type representing the permitted values for the asset property "ConcreteSealant" from the "Concrete" schema.

## Syntax (C#)
```csharp
public enum ConcreteSealantType
```